app/Filters/Auth.php

SELECT *
FROM `user`
WHERE `user`.`id_user` = '2'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $uri = service('uri');
        if (!session()->get('isLoggedIn')) {

            return redirect()->to(site_url('/'));
        }

        //jika datanya tidak sama dengan session maka akan di set ulang session nya
        $model      = new UserModel();
        $select     = $model->find(session()->get('id_user'));