app/Controllers/Menu.php

    public function index()
    {
        $getMenu = $this->model->orderBy('tipe_menu', 'ASC')->findAll();
        $TMenu = $this->model->countAllResults();
        $TMakanan = $this->model->where('tipe_menu', 'makanan')->countAllResults();
        $TMinuman = $this->model->where('tipe_menu', 'minuman')->countAllResults();
        $data = [
            'title' => 'Menu',
            'getMenu' => $getMenu,
            'getMakanan' => $this->model->where('tipe_menu', 'makanan')->findAll(),
            'getMinuman' => $this->model->where('tipe_menu', 'minuman')->findAll(),
---
SELECT *
FROM `menu`
ORDER BY `tipe_menu` ASC
SELECT COUNT(*) AS `numrows`
FROM `menu`
SELECT COUNT(*) AS `numrows`
FROM `menu`
WHERE `tipe_menu` = 'makanan'
SELECT COUNT(*) AS `numrows`
FROM `menu`
WHERE `tipe_menu` = 'minuman'
SELECT *
FROM `menu`
WHERE `tipe_menu` = 'makanan'
SELECT *
FROM `menu`
WHERE `tipe_menu` = 'minuman'