app/Models/CustomModel.php

SELECT *
FROM `order`
JOIN `user` ON `order`.`id_user`=`user`.`id_user`
---
    public function getOrder()
    {
        return $this->db->table('order')
            ->join('user', 'order.id_user=user.id_user')
            ->get()->getResult();

SELECT *
FROM `transaksi`
JOIN `user` ON `transaksi`.`id_user`=`user`.`id_user`
JOIN `order` ON `transaksi`.`id_order`=`order`.`id_order`
ORDER BY `tanggal_transaksi` DESC
---
    public function getTransaksi()
    {
        return $this->db->table('transaksi')
            ->join('user', 'transaksi.id_user=user.id_user')
            ->join('order', 'transaksi.id_order=order.id_order')
            ->orderBy('tanggal_transaksi', 'DESC')
            ->get()->getResult();

SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
JOIN `user` ON `transaksi`.`id_user`=`user`.`id_user`
---
    public function JHargaT()
    { //jumlah harga transaksi berdasarkan keseluruhan
        return $this->db->table('transaksi')
            ->selectSum('total_harga')
            ->join('user', 'transaksi.id_user=user.id_user')
            ->get()->getRow('total_harga');

SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE `id_user` = '2'
---
    public function JHargaTK()
    { //jumlah harga transaksi berdasarkan id_user kasir
        return $this->db->table('transaksi')
            ->selectSum('total_harga')
            ->where(['id_user' => session()->get('id_user')])
            ->get()->getRow('total_harga');